Revit 2024 API
ParameterDownloadOptions.GetCategories Method
 Get categories for binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ISet<ElementId> GetCategories()
Visual Basic
Public Function GetCategories As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetCategories()
See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace